raceTest/Setup/Poly/olaFoam/constant/waveDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveType        irregular;

genAbs          1;

absDir          1.0;

nPaddles        1;

tSmooth         0;

wavePeriods
500
(
95.9692898273
88.809946714
82.6446280992
77.2797527048
72.5689404935
68.3994528044
64.6830530401
61.3496932515
58.3430571762
55.617352614
53.1349628055
50.8646998983
48.7804878049
46.8603561387
45.0856627592
43.4404865334
41.9111483655
40.4858299595
39.1542678152
37.9075056861
36.7376928729
35.6379187455
34.6020761246
33.6247478144
32.7011118378
31.8268618714
30.9981401116
30.2114803625
29.4637595757
28.7521564117
28.0741156654
27.4273176083
26.8096514745
26.2191924489
25.6541816316
25.1130085384
24.5941957698
24.0963855422
23.6183278224
23.1588698472
22.7169468423
22.2915737851
21.8818380744
21.4868929953
21.1059518784
20.7382828702
20.3832042397
20.0400801603
19.7083169097
19.3873594416
19.0766882869
18.775816748
18.4842883549
18.2016745541
17.9275726067
17.6616036736
17.4034110686
17.1526586621
16.9090294217
16.6722240747
16.4419598816
16.2179695102
16
15.7878118093
15.5811779371
15.3798831129
15.1837230489
14.9925037481
14.8060408647
14.6241591109
14.4466917076
14.2734798744
14.1043723554
13.9392249791
13.777900248
13.6202669572
13.4661998384
13.3155792277
13.1682907559
13.0242250586
12.8832775058
12.745347948
12.6103404792
12.4781632144
12.348728081
12.2219506233
12.0977498185
11.9760479042
11.8567702158
11.739845034
11.6252034411
11.5127791849
11.4025085519
11.2943302462
11.1881852763
11.0840168477
10.9817702614
10.8813928183
...
);
waveHeights
500
(
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
6.95592E-146
1.814568E-128
1.391844E-113
8.41968E-101
8.91496E-90
3.15932E-80
6.36804E-72
1.129244E-64
2.52694E-58
9.62998E-53
8.02802E-48
1.80615E-43
1.308908E-39
3.5488E-36
4.0877E-33
2.2293E-30
6.31546E-28
1.00637E-25
9.66032E-24
5.9269E-22
2.4466E-20
7.1052E-19
1.509296E-17
2.42626E-16
3.041E-15
3.0507E-14
2.50676E-13
1.72185E-12
1.00661E-11
5.0889E-11
2.25636E-10
8.8848E-10
3.14178E-09
1.007608E-08
2.95686E-08
0.00000008
2.01154E-07
4.72618E-07
1.043856E-06
2.17848E-06
4.31584E-06
8.15078E-06
1.473024E-05
2.55624E-05
4.27306E-05
0.000069003
0.0001079264
0.0001638908
0.000242158
0.000348844
0.00049085
0.000675746
0.000911608
0.001206818
0.001569834
0.00200894
0.00253204
0.00314632
0.00385816
0.00467288
0.00559458
0.00662604
0.0077687
0.00902256
0.01038624
0.01185702
0.01343094
0.01510284
0.01686656
0.01871508
0.0206406
0.0226348
0.0246886
0.0267934
0.0289394
0.031118
0.0333198
0.035536
0.0377584
0.0399792
...
);
wavePhases
500
(
3.19998
1.97949
5.09999
2.68757
2.0085
4.67769
4.4141
3.76969
3.40389
4.34742
2.45146
1.6152
4.60851
4.34489
0.169205
5.92374
3.22177
1.57134
4.06078
3.67145
3.42299
0.23269
2.58963
0.265148
3.24568
2.22977
2.78721
3.06258
1.77127
4.33588
0.0152717
4.97124
0.0321808
5.11526
1.37563
2.04068
3.50977
5.78974
5.81036
0.63047
3.85397
1.97864
2.24567
2.1793
0.0403487
2.41487
1.81986
3.26212
3.98621
5.88063
0.650381
1.12601
6.11332
3.24001
1.39116
3.07582
5.46978
4.17837
6.13841
0.957862
2.23106
6.15368
5.92911
2.26324
4.98575
1.02155
4.30392
2.21234
0.528106
3.8311
2.8428
4.38208
5.80974
5.08847
0.27819
5.85008
1.22016
2.09805
2.82902
5.20636
1.6955
3.4794
0.04919
1.52564
0.436225
1.44035
4.60146
5.906
5.61872
4.45668
0.580681
1.5666
4.32717
0.226602
3.82984
3.02974
1.24816
1.85057
...
);
waveDirs
500
(
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
...
);

// ************************************************************************* //
